WikDra/esp32-hid-gamepad-bridge/firmware/sdkconfig.defaults.esp32c3
# ESP32-C3 SuperMini: 4 MB flash, no PSRAM, no USB-UART bridge.
# The console has to go over native USB (the USB Serial/JTAG peripheral),
# otherwise the monitor shows nothing.
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Controller activity slots. The default of 6 fits 3 connections + scanning +
# advertising. Set explicitly so it is visible that this is a deliberate value.
# C3-only option: the C6 controller uses the BT_LE_* namespace instead.
CONFIG_BT_CTRL_BLE_MAX_ACT=6
